"""
✅문제 설명
아래 예제와 같이 개를 출력하시오.

입력
없음.

출력
개를 출력한다.




✅목적: 특수 문자 출력 확인 목적

"""

# 코드 작성
# 두 개의 역슬래시 \\를 사용
print("|\\_/|")
print("|q p|   /}")
print("( 0 )\"\"\"\\")
print("|\"^\"`    |")
print("||_/=\\__|")


#r :  Raw 문자열
# Raw 문자열을 사용하면 이스케이프 문자(예: \n, \t, \\)를 그대로 출력할 수 있다.
# r 접두어를 문자열에 적용하여 Raw 문자열로 처리
print('|\\_/|')
print('|q p|   /}')
print('( 0 )"""\\')
print('|"^"`    |')
print('||_/=\\\\__|')




#✅ 백준 테스트에서는 r 접두어가 허용되지 않는가보다. 역슬래쉬 연달아 2개로 풀었더니 해결되었다.
# \n : 줄 바꿈 (Enter)
#\ : 백 슬래시
#\' : 작은 따옴표
#\" : 큰 따옴표


